# brew bundle install - to install the contents of the Brewfile
# https://github.com/Homebrew/homebrew-bundle

# Add additional repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
#tap "stephenc/helm-legacy" -> for old k3d version
# tap "datawire/blackbird" -> for telepresence

# Install tools - 'brew install'
brew "mas"
brew "awscli"
brew "glib"
brew "go"
brew "helm"
brew "httpie"
brew "jq"
brew "k3d"
brew "kubernetes-cli"
brew "lnav"
brew "mr"
brew "node@10"
brew "yarn"
#brew "stephenc/helm-legacy/k3d@3.0.2"
#brew "datawire/blackbird/telepresence"


# Install Mac App Store applications. Comes before 'cask' so a MAS version of an app takes precendence
mas "1Password", id: 443987910
mas "Ethernet Status", id: 834979136
mas "Home Inventory", id: 413564952
mas "HomePass", id: 1330266650
mas "Magnet", id: 441258766
mas "Meeter", id: 1510445899
mas "Microsoft OneNote", id: 784801555
mas "Microsoft OneDrive", id: 823766827
mas "Paprika Recipe Manager 3", id: 1303222628
mas "Pastel", id: 413897608
mas "Pluralsight: Learn Tech Skills", id: 431748264
mas "PocketTube", id: 1533703891
mas "Quiver - take better notes", id: 866773894
mas "SafeInCloud Password Manager", id: 883070818
mas "Screens 4", id: 1224268771
mas "Simplenote", id: 692867256
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
#mas "Soulver 3", id: 1508732804
#mas "Telegram", id: 747648890
mas "Telegram Lite", id: 946399090
mas "TextSniper", id: 1528890965
mas "The Unarchiver", id: 425424353
mas "Time Out", id: 402592703
mas "TouchRetouch", id: 671595950


# Install Mac applications - 'brew install --cask'
cask_args appdir: "~/Applications"
cask "alfred"
cask "appcleaner"
#cask "atom"
cask "boxcryptor"
cask "daisydisk"
cask "default-folder-x"
cask "devutils"
cask "docker"
cask "dropbox"
cask "firefox"
#cask "google-chrome"
cask "intellij-idea"
#cask "java" or cask "zulu"
#tap homebrew/cask-drivers
#cask "logitech-options"
cask "macupdater"
cask "microsoft-edge"
cask "monitorcontrol"
cask "one-switch"
cask "osxfuse"
cask "pdf-expert"
cask "postman"
cask "subler"
#cask "transmission"
cask "transmit"
cask "tuxera-ntfs"
cask "unite"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
